# data.py
data = {
    '技术能力': [
        '请解释一下你如何实现一个SQL查询优化。',
        '描述一下你在数据仓库设计中使用的关键技术。',
        '你如何确保数据迁移过程中的数据完整性？',
        '在你的项目中，你是如何实现软件的安全性和可扩展性的？',
        '你熟悉哪些编程语言，能否展示一段你的代码？'
    ],
    '自我介绍': [
        '请简单介绍一下你自己。',
        '你能否分享你的教育背景和工作经验？',
        '你有哪些技能和专长？',
        '你对自己过去的哪些项目或成就最自豪？',
        '你如何描述你的职业道路到目前为止？'
    ],
    '行为面试': [
        '请描述一个你过去解决过的最具挑战性的问题。',
        '谈谈你如何处理紧急截止日期的经历。',
        '如果你遇到一个难以合作的同事，你会怎样处理？',
        '描述一个你如何领导团队达成目标的例子。',
        '你如何看待我们公司的文化和价值观？'
    ],
    '动机和未来导向面试问题': [
        '你对自己的职业未来有什么规划？',
        '你希望在未来五年内实现什么职业目标？',
        '你为什么对这个行业/领域感兴趣？',
        '你如何看待我们公司的文化和价值观与你的职业目标相契合？',
        '你认为自己在未来的工作中能够发挥什么作用？',
        '你为什么想在这家公司工作？',
        '你对这份工作中最感兴趣的是什么？',
        '你的职业目标是什么，你如何看待这个职位能帮助你实现这些目标？',
    ]
}
